package test.android.dvb;

public class TestCaseDisc {

	static final String test01_autoSearch = ""
			+ " 测试目的：频道列表为空时，测试自动搜索主频点是否成功\n" 
			+ " 步骤1: 判断频道列表是否为空，不为空则测试fail\n"
			+ " 步骤2: 设置主频点，然后执行自动搜索，若搜索失败，则测试fail\n" 
			+ " 步骤3: 搜索完成，切台到最小频道，中间随机频道，最大频道，切台失败则测试fail，否则pass\n\n";
	
	static String test02_getEPG = ""
			+ " 测试目的：验证EPG搜索是否成功\n" 
			+ " 步骤1: 执行主频点的自动搜索，搜索失败则测试fail\n"
			+ " 步骤2: 依次打开几个不同频点的频道的EPG列表，如果有频道无EPG则测试fail，否则测试pass\n";

	static String test03_volume = ""
			+ " 测试目的：验证音量调节和静音图标是否正常呼出\n" 
			+ " 步骤1: 执行主频点的自动搜索，搜索失败则测试fail\n"
			+ " 步骤2: 多次按音量-键，验证是否有音量值为0，如果无则测试fail；多次按音量+" 
			+ "验证是否有音量值为15，如果无则测试fail\n"
			+ " 步骤3: 按静音键，如果无静音图标则测试fail，再按静音键，如果无音量值15图标则测试fail，否则测试pass\n";

	static String test04_chanListUpdate = ""
			+ " 测试目的：验证节目列表更新图标是否能正常弹出，并且触发搜索成功\n" 
			+ " 步骤1: 执行主频点的自动搜索，搜索失败则测试fail\n"
			+ " 步骤2: 切台到事先录制好的NIT版本号跟当前不同的频道下，如果30秒内未弹出更新提示则测试fail\n" 
			+ " 步骤3: 点击确定按钮，如果自动搜索不成功则测试fail，否则测试pass\n";

	
	static String test04010101dvb010101 = ""
			+ " 测试目的：验证频道列表为空的是和否按钮的正确性\n" 
			+ " 步骤1: 清空频道列表，检查全频状态下是否弹出频道列表为空\n"
			+ " 步骤2: 点击否按钮，是否弹出菜单\n"
			+ " 步骤3: 点击是按钮，是否进行自动搜索，且搜索过程无误\n";

	static String test04010101dvb010102 = ""
			+ " 测试目的：验证自动搜索的结果是否能对频道数据进行覆盖\n" 
			+ " 步骤1: 自动搜索451频点，判断频道1,2,3的名称是否都包含F451\n"
			+ " 步骤2: 自动搜索459频点，判断频道1,2,3的名称是否都包含F459，是的话pass\n";
	
	static String test04010101dvb010110 = ""
			+ " 测试目的：验证自动搜索不存在的频点时是否提示搜索失败\n" 
			+ " 步骤1: 自动搜索714频点，判断是否弹出搜索失败提示\n";

	static String test04010101dvb010111 = ""
			+ " 测试目的：验证自动搜索NIT关联的TS未勾选SDT时是否搜索失败'\n" 
			+ " 步骤1: 自动搜索586频点，判断是否搜索失败\n";
	
	static String test04010101dvb010112 = ""
			+ " 测试目的：验证自动搜索NIT未关联TS时是否搜索失败'\n" 
			+ " 步骤1: 自动搜索578频点，判断是否搜索失败\n";
	
	static String test04010101dvb010113 = ""
			+ " 测试目的：验证自动搜索频点不发送NIT时是否搜索失败'\n" 
			+ " 步骤1: 自动搜索570频点，判断是否搜索失败\n";
	
	static String test04010101dvb010114 = ""
			+ " 测试目的：验证自动搜索调制方式为非64QAM时是否失败'\n" 
			+ " 步骤1: 自动搜索主频点，调制方式为非64QAM, 判断是否搜索失败\n";
	
	static String test04010101dvb010115 = ""
			+ " 测试目的：验证自动搜索符号率为非6875时是否失败'\n" 
			+ " 步骤1: 自动搜索主频点，符号率为非6875, 判断是否搜索失败\n";
	
	static String test04010101dvb010116 = ""
			+ " 测试目的：验证自动搜索非国标频点时是否失败'\n" 
			+ " 步骤1: 自动搜索主频点252, 判断是否搜索失败\n";
	
}
